kendryte/arduino-k210/cores/k210/k210-sdk/drivers/k210_i2s.c
    writel(1, &i2s[device_num]->txffr);
    /* flush tx fifo */
    writel(1, &i2s[device_num]->channel[channel_num].tff);
    /* flush individual fifo */

    i2s_set_tx_word_length(device_num, word_length, channel_num);
    /* Word buf_len is RESOLUTION_16_BIT */

    i2s_master_configure(device_num, word_select_size, NO_CLOCK_GATING, word_mode);
    /* word select size is 16 bits,gating after 16 bit */

    i2s_set_tx_threshold(device_num, trigger_level, channel_num);
    /* Interrupt trigger when FIFO level is 8 */

    i2s_transmit_channel_enable(device_num, channel_num, 1);
}

void i2s_init(i2s_device_number_t device_num, i2s_transmit_t rxtx_mode, uint32_t channel_mask)
{
    sysctl_clock_enable(SYSCTL_CLOCK_I2S0 + device_num);
    sysctl_reset(SYSCTL_RESET_I2S0 + device_num);
    sysctl_clock_set_threshold(SYSCTL_THRESHOLD_I2S0 + device_num, 7);
    /*96k:5,44k:12,24k:23,22k:25 16k:35 sampling*/
    /*sample rate*32bit*2 =75MHz/((N+1)*2) */
    i2s_set_enable(device_num, 1);
    i2s_disable_block(device_num, I2S_TRANSMITTER);
    i2s_disable_block(device_num, I2S_RECEIVER);

    if(rxtx_mode == I2S_TRANSMITTER)
    {
        for(int i = 0; i < 4; i++)
        {
            if((channel_mask & 0x3) == 0x3)
            {
                i2s_set_mask_interrupt(device_num, I2S_CHANNEL_0 + i, 1, 1, 1, 1);
                i2s_transimit_enable(device_num, I2S_CHANNEL_0 + i);
            } else
            {
                i2s_transmit_channel_enable(device_num, I2S_CHANNEL_0 + i, 0);
            }
            channel_mask >>= 2;
        }
        i2s_transmit_dma_enable(device_num, 1);
    } else
    {
        for(int i = 0; i < 4; i++)
        {
            if((channel_mask & 0x3) == 0x3)
            {
                i2s_set_mask_interrupt(device_num, I2S_CHANNEL_0 + i, 1, 1, 1, 1);
                i2s_receive_enable(device_num, I2S_CHANNEL_0 + i);
            } else
            {
                i2s_recv_channel_enable(device_num, I2S_CHANNEL_0 + i, 0);
            }
            channel_mask >>= 2;
        }
        /* Set expand_en when receive */
        i2s_set_sign_expand_en(device_num, 1);
        i2s_receive_dma_enable(device_num, 1);
    }
}

uint32_t i2s_set_sample_rate(i2s_device_number_t device_num, uint32_t sample_rate)
{
    ccr_t u_ccr;
    uint32_t pll2_clock = 0;
    pll2_clock = sysctl_pll_get_freq(SYSCTL_PLL2);

    u_ccr.reg_data = readl(&i2s[device_num]->ccr);
    /* 0x0 for 16sclk cycles, 0x1 for 24 sclk cycles 0x2 for 32 sclk */
    uint32_t v_clk_word_size = (u_ccr.ccr.clk_word_size + 2) * 8;
    uint32_t threshold = round(pll2_clock / (sample_rate * 2.0 * v_clk_word_size * 2.0) - 1);
    sysctl_clock_set_threshold(SYSCTL_THRESHOLD_I2S0 + device_num, threshold);
    return sysctl_clock_get_freq(SYSCTL_CLOCK_I2S0 + device_num);
}

int i2s_dmac_irq(void *ctx)
{
    i2s_instance_t *v_instance = (i2s_instance_t *)ctx;
    dmac_irq_unregister(v_instance->dmac_channel);
    if(v_instance->i2s_int_instance.callback)
    {
        v_instance->i2s_int_instance.callback(v_instance->i2s_int_instance.ctx);
    }
    return 0;
}

void i2s_handle_data_dma(i2s_device_number_t device_num, i2s_data_t data, plic_interrupt_t *cb)
{
    configASSERT(device_num < I2S_DEVICE_MAX);

    if(data.mode == I2S_TRANSMITTER) {
        configASSERT(data.send.tx_buf && data.send.tx_len);

        if(data.wait_dma_idle) {
            dmac_wait_done(data.send.tx_channel);
        }

        if(cb) {
            g_i2s_send_instance[device_num].i2s_int_instance.callback = cb->callback;
            g_i2s_send_instance[device_num].i2s_int_instance.ctx = cb->ctx;
            g_i2s_send_instance[device_num].dmac_channel = data.send.tx_channel;
            g_i2s_send_instance[device_num].transfer_mode = I2S_TRANSMITTER;
            dmac_irq_register(data.send.tx_channel, i2s_dmac_irq, &g_i2s_send_instance[device_num], cb->priority);
        }

        sysctl_dma_select((sysctl_dma_channel_t)data.send.tx_channel, SYSCTL_DMA_SELECT_I2S0_TX_REQ + device_num * 2);
        dmac_set_single_mode(data.send.tx_channel, data.send.tx_buf, (void *)(&i2s[device_num]->txdma), DMAC_ADDR_INCREMENT,
                             DMAC_ADDR_NOCHANGE, DMAC_MSIZE_1, DMAC_TRANS_WIDTH_32, data.send.tx_len);

        if(!cb && data.wait_dma_done) {
            dmac_wait_done(data.send.tx_channel);
        }
    } else {
        configASSERT(data.recv.rx_buf && data.recv.rx_len);
        if(data.wait_dma_idle) {
            dmac_wait_done(data.recv.rx_channel);
        }

        if(cb) {
            g_i2s_recv_instance[device_num].i2s_int_instance.callback = cb->callback;
            g_i2s_recv_instance[device_num].i2s_int_instance.ctx = cb->ctx;
            g_i2s_recv_instance[device_num].dmac_channel = data.recv.rx_channel;
            g_i2s_recv_instance[device_num].transfer_mode = I2S_RECEIVER;
            dmac_irq_register(data.recv.rx_channel, i2s_dmac_irq, &g_i2s_recv_instance[device_num], cb->priority);
        }

        sysctl_dma_select((sysctl_dma_channel_t)data.recv.rx_channel, SYSCTL_DMA_SELECT_I2S0_RX_REQ + device_num * 2);
        dmac_set_single_mode(data.recv.rx_channel, (void *)(&i2s[device_num]->rxdma), data.recv.rx_buf, DMAC_ADDR_NOCHANGE, DMAC_ADDR_INCREMENT,
                             DMAC_MSIZE_1, DMAC_TRANS_WIDTH_32, data.recv.rx_len);

        if(!cb && data.wait_dma_done) {
            dmac_wait_done(data.recv.rx_channel);
        }
    }
}
